Revit 2027 API
MEPCurveType.Transition Property
The default transition fitting of the MEP curve type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilySymbol Transition { get; set; }
Public Property Transition As FamilySymbol
	Get
	Set
public:
property FamilySymbol^ Transition {
	FamilySymbol^ get ();
	void set (FamilySymbol^ value);
}
member Transition : FamilySymbol with get, set
Property Value
FamilySymbol
Remarks
This property is used to retrieve the default transition fitting of the MEP curve type, and can be null if there is no default value. Use RoutingPreferenceManager to set this property for PipeType MEPCurves.
See Also
Reference
MEPCurveType Class
Autodesk.Revit.DB Namespace